# Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dtypes

A    float64
B    float64
C      int64
dtype: object

In [6]:
#By default dropna will drop all rows with any NaN values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [7]:
#Drop columns with any NaN values
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [8]:
#Setting the threshold to 2
#Only drop rows with 2 or more NaN values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [11]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64